ARMmbed/mbed-os/targets/TARGET_Freescale/TARGET_MCUXpresso_MCUS/TARGET_KL82Z/device/MKL82Z7.h
#define __CM0PLUS_REV                  0x0000    /**< Core revision r0p0 */
#define __MPU_PRESENT                  0         /**< Defines if an MPU is present or not */
#define __VTOR_PRESENT                 1         /**< Defines if VTOR is present or not */
#define __NVIC_PRIO_BITS               2         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */

#include "core_cm0plus.h"              /* Core Peripheral Access Layer */
#include "system_MKL82Z7.h"            /* Device specific configuration file */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
/*!
 * @addtogroup edma_request
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections. The user can configure the
 * hardware request into DMAMUX to trigger the DMA transfer accordingly. The index
 * of the hardware request varies according  to the to SoC.
 */
typedef enum _dma_request_source {
    kDmaRequestMux0Disable          = 0 | 0x100U,  /**< DMAMUX TriggerDisabled. */
    kDmaRequestMux0FlexIO0Channel0  = 1 | 0x100U,  /**< FLEXIO0. */
    kDmaRequestMux0FlexIO0Channel1  = 2 | 0x100U,  /**< FLEXIO0. */
    kDmaRequestMux0FlexIO0Channel2  = 3 | 0x100U,  /**< FLEXIO0. */
    kDmaRequestMux0FlexIO0Channel3  = 4 | 0x100U,  /**< FLEXIO0. */
    kDmaRequestMux0FlexIO0Channel4  = 5 | 0x100U,  /**< FLEXIO0. */
    kDmaRequestMux0FlexIO0Channel5  = 6 | 0x100U,  /**< FLEXIO0. */
    kDmaRequestMux0FlexIO0Channel6  = 7 | 0x100U,  /**< FLEXIO0. */
    kDmaRequestMux0FlexIO0Channel7  = 8 | 0x100U,  /**< FLEXIO0. */
    kDmaRequestMux0I2C0             = 9 | 0x100U,  /**< I2C0 Transmit or Receive. */
    kDmaRequestMux0I2C1             = 10 | 0x100U, /**< I2C1 Transmit or Receive. */
    kDmaRequestMux0Reserved11       = 11 | 0x100U, /**< Reserved11 */
    kDmaRequestMux0Reserved12       = 12 | 0x100U, /**< Reserved12 */
    kDmaRequestMux0Reserved13       = 13 | 0x100U, /**< Reserved13 */
    kDmaRequestMux0Reserved14       = 14 | 0x100U, /**< Reserved14 */
    kDmaRequestMux0LPUART0Rx        = 15 | 0x100U, /**< LPUART0 Receive. */
    kDmaRequestMux0LPUART0Tx        = 16 | 0x100U, /**< LPUART0 Transmit. */
    kDmaRequestMux0LPUART1Rx        = 17 | 0x100U, /**< LPUART1 Receive. */
    kDmaRequestMux0LPUART1Tx        = 18 | 0x100U, /**< LPUART1 Transmit. */
    kDmaRequestMux0LPUART2Rx        = 19 | 0x100U, /**< LPUART2 Receive. */
    kDmaRequestMux0LPUART2Tx        = 20 | 0x100U, /**< LPUART2 Transmit. */
    kDmaRequestMux0SPI0Rx           = 21 | 0x100U, /**< SPI0 Receive. */
    kDmaRequestMux0SPI0Tx           = 22 | 0x100U, /**< SPI0 Transmit. */
    kDmaRequestMux0SPI1Rx           = 23 | 0x100U, /**< SPI1 Receive. */
    kDmaRequestMux0SPI1Tx           = 24 | 0x100U, /**< SPI1 Transmit. */
    kDmaRequestMux0QSPI0Rx          = 25 | 0x100U, /**< QuadSPI0 Receive. */
    kDmaRequestMux0QSPI0Tx          = 26 | 0x100U, /**< QuadSPI0 Transmit. */
    kDmaRequestMux0TPM0Channel0     = 27 | 0x100U, /**< TPM0 C0V. */
    kDmaRequestMux0TPM0Channel1     = 28 | 0x100U, /**< TPM0 C1V. */
    kDmaRequestMux0TPM0Channel2     = 29 | 0x100U, /**< TPM0 C2V. */
    kDmaRequestMux0TPM0Channel3     = 30 | 0x100U, /**< TPM0 C3V. */
    kDmaRequestMux0TPM0Channel4     = 31 | 0x100U, /**< TPM0 C4V. */
    kDmaRequestMux0TPM0Channel5     = 32 | 0x100U, /**< TPM0 C5V. */
    kDmaRequestMux0Reserved33       = 33 | 0x100U, /**< Reserved33 */
    kDmaRequestMux0Reserved34       = 34 | 0x100U, /**< Reserved34 */
    kDmaRequestMux0TPM0Overflow     = 35 | 0x100U, /**< TPM0. */
    kDmaRequestMux0TPM1Channel0     = 36 | 0x100U, /**< TPM1 C0V. */
    kDmaRequestMux0TPM1Channel1     = 37 | 0x100U, /**< TPM1 C1V. */
    kDmaRequestMux0TPM1Overflow     = 38 | 0x100U, /**< TPM1. */
    kDmaRequestMux0TPM2Channel0     = 39 | 0x100U, /**< TPM2 C0V. */
    kDmaRequestMux0TPM2Channel1     = 40 | 0x100U, /**< TPM2 C1V. */
    kDmaRequestMux0TPM2Overflow     = 41 | 0x100U, /**< TPM2. */
    kDmaRequestMux0TSI0             = 42 | 0x100U, /**< TSI0. */
    kDmaRequestMux0EMVSIM0Rx        = 43 | 0x100U, /**< EMVSIM0 Receive. */
    kDmaRequestMux0EMVSIM0Tx        = 44 | 0x100U, /**< EMVSIM0 Transmit. */
    kDmaRequestMux0EMVSIM1Rx        = 45 | 0x100U, /**< EMVSIM1 Receive. */
    kDmaRequestMux0EMVSIM1Tx        = 46 | 0x100U, /**< EMVSIM1 Transmit. */
    kDmaRequestMux0PortA            = 47 | 0x100U, /**< PTA. */
    kDmaRequestMux0PortB            = 48 | 0x100U, /**< PTB. */
    kDmaRequestMux0PortC            = 49 | 0x100U, /**< PTC. */
    kDmaRequestMux0PortD            = 50 | 0x100U, /**< PTD. */
    kDmaRequestMux0PortE            = 51 | 0x100U, /**< PTE. */
    kDmaRequestMux0ADC0             = 52 | 0x100U, /**< ADC0. */
    kDmaRequestMux0Reserved53       = 53 | 0x100U, /**< Reserved53 */
    kDmaRequestMux0DAC0             = 54 | 0x100U, /**< DAC0. */
    kDmaRequestMux0LTC0PKHA         = 55 | 0x100U, /**< LTC0 PKHA. */
    kDmaRequestMux0CMP0             = 56 | 0x100U, /**< CMP0. */
    kDmaRequestMux0Reserved57       = 57 | 0x100U, /**< Reserved57 */
    kDmaRequestMux0LTC0InputFIFO    = 58 | 0x100U, /**< LTC0 Input FIFO. */
    kDmaRequestMux0LTC0OutputFIFO   = 59 | 0x100U, /**< LTC0 Output FIFO. */
    kDmaRequestMux0AlwaysOn60       = 60 | 0x100U, /**< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn61       = 61 | 0x100U, /**< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn62       = 62 | 0x100U, /**< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn63       = 63 | 0x100U, /**< DMAMUX Always Enabled slot. */
} dma_request_source_t;

/* @} */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


